아키텍처 구조도 mermaid 기반으로 변경
